photo_dict = {
    'photo_family': '',

}

text_dict = {
    'pravila':
        '''
-Этот бот для поиска партнеров по "интересам".
-Данный бот предназначен для лиц старше 18 лет. Нажимая кнопку "хорошо", вы подтверждаете, что вам есть 18 лет.
-Данный бот несет информационный характер.
-Администрация бота не несет ответственности за достоверность информации. 
-Запрещены оскорбления.
-Относиться с уважением и достоинством, не смотря на убеждения собеседника.
-Запрещается продавать и продвигать какие-либо товары или услуги.
-Запрещается добавлять фотографии обнаженного тела, сексуального или порнографического характера.
-Указывайте достоверную информацию о себе дабы поиск был быстрее и правильнее. 
-Запрещено размещение каких-либо ссылок, номеров телефонов или мэйлы.
-Администрация сервиса оставляет за собой право отказать в доступе любому участнику без объяснения причин.\n
-Если вы столкнулись с анкетой, нарушающей одно из этих правил, сообщите, пожалуйста, в службу поддержки.
-Нажимая на кнопку «Хорошо», вы подтверждаете, что прочитали все правила и согласны выполнять их, а также согласны с тем, что за нарушение одного или нескольких вышеописанных правил, ваш аккаунт на сервисе будет заблокирован.\n
''',
    'qw_1':
        '''Укажите ваше Имя.\n ''',
    'qw_6':
        ' Укажите ваш пол.',
    'qw_6_1':
        'Укажите пол партнера.',

    'qw_7':
        'Укажите дату вашего рождения.\nДату рождения необходимо ввести в формате ДД.ММ.ГГГГ (например 01.01.2001)',
    'qw_9': 'В каком городе вы живете?',
    'qw_9_1': 'Напишите город на русском языке',
    'qw_9_2': 'Нет такого города в базе, напишите еще раз',
    'qw_9_3': 'Вы уверены, что ваш город {}',
    'qw_10':
        '''Ваша позиция в теме''',
    'qw_11':
        '''Кого вы ищете.\n''',
    'qw_12':
        '''Какие практики вы предпочитаете? ''',
    'qw_13':
        '''Какие у вас табу?''',
    'qw_14':
        '''Загрузите одну или несколько фотографий.\n''',
    'qw_15':
        '''О себе''',
    'qw_17_1':
        'Показывать ли анкеты участников из другого города?',
    'qw_17_2':
        'Какой формат взаимодействия вы предпочитаете?',

    'qw_20':
        'Минимальный подходящий возраст.',
    'qw_21':
        'Максимальный подходящий возраст.',
    'qw_22':
        '''Хорошо, анкета отправилась модератору ''',

        'qw_23':
            'Давайте продолжим знакомства',
        'qw_24':
            'Анкета отредактирована',

}



text_main_menu = {
    'support': '''Для получения поддержки, обратитесь @interest_dating_support_bot''',
    'useful_tips': '''Доп. инфа'''
}