photo_dict = {
    'photo_family': '',

}

text_dict = {
    'pravila':
        '''
-Этот бот для поиска партнеров по интересам.
-Данный бот предназначен для лиц старше 18 лет, нажимая кнопку "хорошо" вы подтверждаете что вам есть 18 лет.
-Запрещены оскорбления.
-Относиться с уважением и достоинством не смотря на убеждения собеседника.
-Запрещается Продавать и продвигать какие-либо товары или услуги.
-Запрещается добавлять фотографии обнаженного тела, сексуального или порнографического характера.
-Указывайте достоверную информацию о себе дабы поиск был быстрее и правильнее. 
-Запрещено размещение каких-либо ссылок, номеров телефонов или мэйлы.
-Администрация сервиса оставляет за собой право отказать в доступе любому участнику без объяснения причин.\n
-Нажимая на кнопку «Хорошо», вы подтверждаете, что прочитали все правила и согласны выполнять их, а также согласны с тем, что за нарушение одного или нескольких вышеописанных правил ваш аккаунт на сервисе будет заблокирован.\n
-Если вы столкнулись с анкетой нарушающей одно из этих правил сообщите пожалуйста в службу поддержки.''',
    'qw_1':
        '''🖋 Укажите ваше Имя.\n ''', # TODO объединить имя и фамилию
    'qw_6':
        '🚻 Укажите ваш пол.',
    'qw_7':
        '🗓 Укажите дату вашего рождения.\nДату рождения необходимо ввести в формате ДД-ММ-ГГГГ (например 01-01-2001)',
    'qw_9': '🌆 В каком городе вы живете?',
    'qw_9_1': '🌆 Напиши те город русскими буквами',
    'qw_10':
        '''Твоя позиция в теме''',
    'qw_11':
        '''Кого ты ищешь.\n''',
    'qw_12':
        '''📜🖋Какие практики ты предпочитаешь? ''',
    'qw_13':
        '''Какие у тебя табу?''',
    'qw_14':
        '''📸 Загрузите несколько фотографий.\n''',
    'qw_15':
        '''О себе''',
    'qw_17_1':
        'Показывать ли анкеты участников из другого города?',
    'qw_20':
        'Минимальный подходящий возраст.',
    'qw_21':
        'Максимальный подходящий возраст.',
    'qw_22':
        '''Хорошо, анкета отправилась модератору ''',
        'qw_23':
            'Давайте продолжим знакомства',
        'qw_24':
            'Анкета отредактирована',

}



text_main_menu = {
    'support': '''Для получения поддержки обратитесь https://t.me/john_smith1113''',
    'useful_tips': '''Доп. инфа'''
}