photo_dict = {
    'photo_family': 'AgACAgIAAxkBAAICQ2QAAY6FoX4qEZk0oMnXE7jmmw03lAACrccxG0DWyUt49-D-NuacvwEAAwIAA3MAAy4E',

}

text_dict = {
    'text_family':
        '''🙋🏼‍♂️🙋🏼‍♀️ Привет! 
Это Антон и Юля Пятайкины.\n 
Добро пожаловать в наш сервис христианских знакомств SoulMates ❤️\n
Мы сделали этот сервис для людей, которые хотят создать крепкую счастливую семью, основанную на библейских принципах ✝️\n
🙅🏼‍♂️ SoulMates не для того, чтобы находить бизнес партнеров, полистать фотографии девушек, найти интимные отношения, 
друзей по переписке, продвигать не библейские взгляды, искать финансовую поддержку и т.д.\n 
Здесь люди, которые хотят встретить спутника жизни, вторую половину, свою судьбу, родственную душу — и создать 
счастливую семью 🤵🏼‍♂️👰🏻‍♀️\n
Если вы здесь именно за этим, давайте начнем ✅''',
    'pravila':
        '''📃 Мы установили правила пользования этим сервисом. Внимательно изучите их:\n
1️⃣ Это сервис для христиан традиционной сексуальной ориентации, регулярно посещающих церковь и читающих Библию. 
2️⃣ Это сервис для поиска мужа/жены.
3️⃣ Участником данного сервиса можно стать, достигнув возраста 17 лет.
4️⃣ Вы обязаны указывать правдивую информацию о себе — возраст, пол, семейное положение и т.д. 
5️⃣ К каждому участнику сервиса следует относиться с уважением и достоинством, независимо от его происхождения или убеждений.
6️⃣ Запрещены оскорбления в любой форме и по любой теме.
7️⃣ Запрещено продавать товары или услуги участникам сервиса.
8️⃣ Запрещено добавлять в анкету какие-либо ссылки, номера телефонов или мэйлы.
9️⃣ Не просите и не отправляйте деньги участникам сервиса.
🔟 Запрещено добавлять в анкету фотографии обнаженного тела, сексуального или порнографического характера.
1️⃣1️⃣ Запрещена проповедь любых религиозных убеждений, отличных от христианства.
1️⃣2️⃣ Запрещено критиковать взгляды и убеждения любой деноминации, отличной от вашей.\n
❗️ Мы стараемся максимально тщательно проверять каждую анкету и обезопасить всех участников сервиса, но сделать это 
на 100 % невозможно. Поэтому еще раз просим — не отправляйте деньги и личные данные другим участникам.\n
‼️ Администрация сервиса оставляет за собой право отказать в доступе любому участнику без объяснения причин.\n
🙏🏻 Нажимая на кнопку «Хорошо», вы подтверждаете, что прочитали все правила и согласны выполнять их, а также согласны 
с тем, что за нарушение одного или нескольких вышеописанных правил ваш аккаунт на сервисе будет заблокирован.\n
Если вы столкнулись с анкетой нарушающей одно из этих правил сообщите пожалуйста в службу поддержки.''',
    'acsept':
        '''🗂 Для надежной работы сервиса мы запросим у вас некоторые личные данные.\n
Мы делаем это в целях безопасности других участников нашего сервиса христианских знакомств SoulMates, а также для 
отправки уведомлений о новостях и работе сервиса.\n
🙅🏼‍♀️ Мы не передаем ваши данные третьим лицам и другим участникам сервиса. Эти данные доступны только администрации сервиса.\n 
Согласны ли вы поделиться вашей личной информацией? 🧐''',
    'userName_instructions':
        '''Чтобы продолжить вам необходимо задать своему аккаунту в телеграмм специальное имя “username”. 
Для этого прямо сейчас зайдите в настройки телеграмм, нажмите на кнопочку «Изменить»(edit), 
далее найдите строку «Имя пользователя»(username) и введите любое имя которое вам нравится. 
Отлично! Возвращайтесь в бота знакомств и продолжим.''',
    'qw_0':
        '''📝 Начнем с заполнения вашей анкеты.\n
Британские ученые доказали — чем ответственнее вы отнесетесь к этому этапу, чем подробнее и честнее заполните анкету, 
тем больше пользы принесет вам этот сервис 👍🏻\n
Имя, возраст, семейное положение, география и увлечения, фотографии и видео — все это поможет вам найти того самого человека.\n
❗️ Если с каким-то этапом возникнут трудности (например, с видеовизиткой), не переживайте — вы можете пропустить этот 
пункт и добавить файлы позже. Тем более в разделе полезных материалов (будет доступен после заполнения анкеты) мы 
подготовили инструкцию о том, как сделать свое видео красивым вне зависимости от качества камеры в вашем телефоне.\n
Приступим ❓''',
    'qw_1':
        '''🖋 Укажите ваше Имя.\n 
Это должны быть реальное имя, иначе анкета не пройдет модерацию.''', # TODO объединить имя и фамилию
    'qw_2':
        '''🖋 Укажите вашу Фамилию.\n
Это должны быть реальная фамилия, иначе анкета не пройдет модерацию.\n
❗️ Участникам сообщества будет видно только имя, фамилия доступна исключительно модератору.''',
    'qw_3':
        '''📬 Введите свою актуальную электронную почту, чтобы мы могли связаться с вами. \n
❗️ Ее не увидят другие участники сообщества, только модераторы.''',
    'qw_4':
        '''Эти данные также будут доступны только модераторам и нужны для безопасности, чтобы мы могли проверить 
реальность зарегистрированного человека.\n
❗️❗️❗️ ВНИМАНИЕ! Чтобы отправить свой номер, не нужно вводить его вручную. Достаточно нажать на кнопку «Поделиться номером»,
и телеграм автоматически отправит его нам. \n
🤪 Да, выглядит как что-то невероятное, но это действительно так работает!''',
    'qw_5':
        '''📱 А теперь социальные сети.\n
Укажите ссылку на ваш аккаунт в той соц. сети, которой вы чаще всего пользуетесь и в которой есть ваши фотографии 
и дополнительная информация.\n
❗️ Если ваш аккаунт в Instagram закрыт, укажите другую соц. сеть.\n
Эта информация доступна только модераторам. ''',
    'qw_6':
        '🚻 Укажите ваш пол.',
    'qw_7':
        '🗓 Укажите дату вашего рождения.\nДату рождения необходимо ввести в формате ДД-ММ-ГГГГ (например 01-01-2001)',
    'qw_8': '🌍 Укажите страну, в которой вы проживаете.',
    'qw_9': '🌆 В каком городе вы живете?',
    'qw_10':
        '''✝️ Выберите, к какой конфессии вы себя относите.\n
Баптисты, пятидесятники, харизматы, евангелисты, адвентисты, англикане, кальвинисты, лютеране, методисты, пресвитериане\n
❗️ Если ваша конфессия не представлена, выбери пункт “Тут нет моей конфессии"''', # TODO сделать принятие конфесии просто при ввооде, а не через кнопку
    'qw_10_1': 'Введите название свой конфесии, после заполнения анкеты модератор проверит и корректность названия'
               'и при необходимости добавит вашу конфессию в список доступных для выбора',
    'qw_11':
        '''⛪️ Напишите название церкви, которую вы посещаете.\n
❗️ Эту информацию увидит только модератор.''',
    'qw_12':
        '''📜🖋 Расскажите о себе.\n
(Помните про британских ученых?)\n
Что можно рассказать? 🤔 \n
В каком городе вы родились, где и на кого учились/учитесь, где работаете, в каком служении участвуете, семейное 
положение, есть ли дети, чем любите заниматься в свободное время, хобби, о чем мечтаете (помимо счастливой семьи), 
где бы вы хотели жить и чем заниматься через 3 года? \n
❗️ Чем подробнее вы расскажете о себе, тем интереснее будет ваша анкета и тем больше поводов для знакомства это даст 
другим участникам сервиса. Постарайтесь не просто односложно перечислить факты, но написать развернуто.
Вам же будет лучше 👍🏻\n
❗️ Пожалуйста, не указывайте тут свои контакты или соц. сети и не предлагайте что-то купить или отправить вам финансы.
Такие анкеты не пройдут модерацию.\n''',
    'qw_13':
        '''📸 Загрузите несколько фотографий.\n
🙋🏼‍♂️ Вам нужна основная фотография анкеты — кадр, где вас видно в полный рост, и еще несколько дополнительных кадров 
(например, с занятий хобби или служения в церкви).\n
Чем больше фотографий, тем интереснее ваша анкета. 
Позднее вы сможете добавить, удалить или заменить фотографии.\n
❗️ Лучше всего, когда на основной фотографии хорошо видно ваше лицо
‼️ Вы можете пропустить этот шаг и смотреть анкеты других участников, но пока вы не добавите хотя бы одно фото, вы не 
сможете пройти проверку модератором и писать сообщения другим пользователям сервиса, а они не смогут видеть вашу анкету.''',
    'qw_14':
        'Загрузить еще фото?',
    'qw_15':
        '''🎥 Добавьте вашу видеовизитку.\n 
🙋🏼‍♀️ Цель видеовизитки — дать возможность другим пользователям услышать ваш голос, увидеть мимику и «почувствовать» вас.\n
Рекомендация: 
Это должно быть видео 15–30 секунд, в котором вас хорошо видно и слышно и вы рассказываете какой-то интересный факт о себе — любой.\n
❗️ В разделе полезных материалов нашего сервиса есть небольшая видеоинструкция-рекомендация как лучше снять такую визитку.\n
‼️Вы можете пропустить этот шаг, он не влияет на пользование сервисом, но анкеты с видео визитками привлекательнее для других пользователей.''',
    'qw_16':
        '''✅ Мы заботимся о качестве и безопасности нашего сервиса, поэтому желательно прислать 
рекомендацию от пастора, лидера или авторитетного члена церкви (кто-то, кто старше вас, давно ходит в церковь 
и хорошо знает вас (не мама с папой 😅)).\n
Если у вас будет рекомендация, то в вашей анкете появится специальный значек - 📮. Если вы видите в анкетах 
других пользователей такую зеленую галочку, то знайте - от них так же получена рекомендация.\n
Как это сделать❓ Скопируйте сообщение ниже и отправьте его человеку, который мог бы за вас поручиться. В этом сообщении 
небольшая инструкция для поручителя и почта для отправки рекомендации.\n
❗️ Прежде чем пересылать это человеку, свяжитесь с ним и объясните, что это такое и чего вы от него хотите.''',
    'qw_16_1':
        '''Здравствуйте! Это администрация христианского сервиса знакомств SoulMates.

Большое спасибо, что согласились помочь с рекомендацией. Пожалуйста, расскажите нам в нескольких предложениях в 
свободной форме о {} {}.

Как давно вы знакомы? Как можете охарактеризовать этого человека?
 
Отправьте вашу рекомендацию на почту support@pyataykins.com

Пожалуйста в начале письма укажите этот уникальный номер анкеты: {}
Иначе мы не сможем добавить информацию, что для участника сервиса получена рекомендация🙏🏻

🙏🏻 Это нужно, чтобы сервис был максимально безопасным. Информация будет доступна только администрации сервиса.''',
    'qw_17':
        '''🔋 Еще несколько вопросов, чтобы лучше понять, какого человека вы хотите найти.\n
Показывать ли анкеты участников из другого города?''',
    'qw_17_1':
        'Показывать ли анкеты участников из другого города?',
    'qw_18':
        'Как насчет анкет участников из другой страны',
    'qw_19':
        'Хотите ли вы видеть анкеты участников из другой конфессии?',
    'qw_20':
        'Минимальный подходящий возраст.',
    'qw_21':
        'Максимальный подходящий возраст.',
    'qw_22':
        '''🥇 Отлично! Ваша анкета отправлена модераторам на проверку. Возможно, мы позвоним вам или напишем для 
уточнения деталей. А может быть, и нет.\n
🥈 Также настоятельно рекомендуем напоминать своему поручителю об отправке рекомендации для вас.\n
🥉 Когда анкета пройдет модерацию, вы получите сообщение об этом, а пока вы можете посмотреть анкеты других участников 
и познакомиться со всеми возможностями нашего сервиса.\n
❗️ Обратите внимание на раздел «Полезные материалы»: там мы публикуем советы и подкасты — например, с историями семей, 
познакомившихся в интернете, видео с психологами и экспертами о том, как общаться в сети, на что обращать внимание и как
начинать отношения, аудиоверсии книг об отношениях и другие материалы.\n
 😎 Эти материалы доступны только участникам нашего сервиса.\n
💥 Всегда помните, что в любой момент вы можете написать в тех. поддержку: свой вопрос, замечание или предложение по 
работе нашего сервиса. Мы с радостью и в кратчайшие сроки постараемся ответить вам и помочь 🤓\n
🙌🏻 Благословляем вас и молимся, чтобы Бог дал вам самого правильного спутника жизни через наш сервис (или любым другим способом).''',
        'qw_23':
            'Давайте продолжим знакомства',
        'qw_24':
            'Анкета отредактирована',

}

video_dict = {
    'video_family': 'tgbot/media/hello_video.mp4',
    'username': 'BAACAgIAAxkBAAICSGQAAZTVWSthNEBQxgbHPBWMc_rkDQACSCoAAtJzCUgQxyOWZ-MIOC4E'
}


text_main_menu = {
    'support': '''🙋🏼‍♂️🙋🏼‍♀️ Привет! Если у вас возникли трудности или вопросы во время пользования сервисом SoulMates вы 
можете написать в службу поддержки support@pyataykins.com или телеграм чат https://t.me/soulmateshelp 
(💡 кстати, в этом чате в закреплённых сообщениях есть ответы на часто задаваемые вопросы и различные инструкции, возможно уже есть готовый ответ на ваш вопрос🙏🏻)''',
    'useful_tips': '''Чтобы получить советы как знакомиться и строить отношения через сервис христианских знакомств - переходите в наш специальный канал с полезными материалами доступный только участникам SoulMates
https://t.me/+xlawnfDsxKs5NWFi'''
}